Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
ter                              = 7
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
    }

  # aws_backup_selection.gaspi_backup_selection will be created
  + resource "aws_backup_selection" "gaspi_backup_selection" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "gaspi_backup_resource_selection"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)
      + region        = "ap-southeast-3"

      + condition (known after apply)

      + selection_tag {
          + key   = "backup"
          + type  = "STRINGEQUALS"
          + value = "true"
        }
    }

  # aws_backup_vault.gaspi_backup_vault will be created
  + resource "aws_backup_vault" "gaspi_backup_vault" {
      + arn             = (known after apply)
      + force_destroy   = true
      + id              = (known after apply)
      + kms_key_arn     = (known after apply)
      + name            = "gaspi_backup_vault"
      + recovery_points = (known after apply)
      + region          = "ap-southeast-3"
      + tags            = {
          + "Environment" = "dev"
          + "Owner"       = "gaspi"
        }
      + tags_all        = {
          + "Environment" = "dev"
          + "Owner"       = "gaspi"
        }
    }

  # aws_iam_role.gaspi_backup_role will be created
  + resource "aws_iam_role" "gaspi_backup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "backup.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_backup_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.gaspi_backup_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_backup_role_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup"
      + role       = "gaspi_backup_role"
    }

  # aws_iam_role_policy_attachment.gaspi_backup_s3_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_backup_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Backup"
      + role       = "gaspi_backup_role"
    }

  # aws_iam_role_policy_attachment.gaspi_restore_s3_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_restore_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Restore"
      + role       = "gaspi_backup_role"
    }

  # module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_authenticated will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "gaspi_authenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "gaspi_unauthenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendClinicJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendClinicJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:997141225542:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:997141225542:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendRegistrationEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendRegistrationEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:997141225542:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:997141225542:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "manager_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.ses-sns-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ses-sns-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSESToPublishToSNS"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "997141225542",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cognito.aws_cognito_identity_pool.gaspi_identity_pool will be created
  + resource "aws_cognito_identity_pool" "gaspi_identity_pool" {
      + allow_classic_flow               = false
      + allow_unauthenticated_identities = false
      + arn                              = (known after apply)
      + id                               = (known after apply)
      + identity_pool_name               = "gaspi-users"
      + region                           = "ap-southeast-3"
      + tags                             = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                         = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }

      + cognito_identity_providers {
          + client_id               = (known after apply)
          + provider_name           = (known after apply)
          + server_side_token_check = false
        }
    }

  # module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles will be created
  + resource "aws_cognito_identity_pool_roles_attachment" "gaspi_cognito_roles" {
      + id               = (known after apply)
      + identity_pool_id = (known after apply)
      + region           = "ap-southeast-3"
      + roles            = (known after apply)

      + role_mapping {
          + ambiguous_role_resolution = "AuthenticatedRole"
          + identity_provider         = (known after apply)
          + type                      = "Token"
        }
    }

  # module.cognito.aws_cognito_user.admin will be created
  + resource "aws_cognito_user" "admin" {
      + attributes            = {
          + "email"          = "admin@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Admin"
          + "given_name"     = "Admin"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + region                = "ap-southeast-3"
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "admin@example.com"
    }

  # module.cognito.aws_cognito_user.guest will be created
  + resource "aws_cognito_user" "guest" {
      + attributes            = {
          + "email"          = "guest@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Guest"
          + "given_name"     = "Guest"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + region                = "ap-southeast-3"
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "guest@example.com"
    }

  # module.cognito.aws_cognito_user_group.admin_group will be created
  + resource "aws_cognito_user_group" "admin_group" {
      + description  = "Group of users who can has admin privileges"
      + id           = (known after apply)
      + name         = "administrators"
      + precedence   = 1
      + region       = "ap-southeast-3"
      + role_arn     = (known after apply)
      + user_pool_id = (known after apply)
    }

  # module.cognito.aws_cognito_user_group.manager_group will be created
  + resource "aws_cognito_user_group" "manager_group" {
      + description  = "Group of users who can has management privileges"
      + id           = (known after apply)
      + name         = "managers"
      + precedence   = 2
      + region       = "ap-southeast-3"
      + role_arn     = (known after apply)
      + user_pool_id = (known after apply)
    }

  # module.cognito.aws_cognito_user_in_group.admin_in_admin_group will be created
  + resource "aws_cognito_user_in_group" "admin_in_admin_group" {
      + group_name   = "administrators"
      + id           = (known after apply)
      + region       = "ap-southeast-3"
      + user_pool_id = (known after apply)
      + username     = "admin@example.com"
    }

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be created
  + resource "aws_cognito_user_pool" "gaspi_user_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OPTIONAL"
      + name                       = "gaspi-users"
      + region                     = "ap-southeast-3"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                   = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + user_pool_tier             = (known after apply)

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + email_configuration {
          + configuration_set     = "ses-feedback-config"
          + email_sending_account = "DEVELOPER"
          + from_email_address    = "diantest2020@gmail.com"
          + source_arn            = "arn:aws:ses:ap-southeast-3:997141225542:identity/diantest2020@gmail.com"
        }

      + lambda_config {
          + custom_message       = (known after apply)
          + pre_token_generation = (known after apply)

          + pre_token_generation_config (known after apply)
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type      = "Boolean"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "terraform"
          + required                 = false
        }
      + schema {
          + attribute_data_type      = "Boolean"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "is_medical_director"
          + required                 = false
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "identity_id"
          + required                 = false

          + string_attribute_constraints {
                # (2 unchanged attributes hidden)
            }
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + software_token_mfa_configuration {
          + enabled = true
        }

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.cognito.aws_cognito_user_pool_client.gaspi_user_pool_client will be created
  + resource "aws_cognito_user_pool_client" "gaspi_user_pool_client" {
      + access_token_validity                         = 60
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = 3
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
        ]
      + id                                            = (known after apply)
      + id_token_validity                             = 60
      + logout_urls                                   = (known after apply)
      + name                                          = "gaspi-users-client"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = 72
      + region                                        = "ap-southeast-3"
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)

      + token_validity_units {
          + access_token  = "minutes"
          + id_token      = "minutes"
          + refresh_token = "hours"
        }
    }

  # module.cognito.aws_iam_policy.admin_group_role_policy will be created
  + resource "aws_iam_policy" "admin_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "admin group permissions"
      + id               = (known after apply)
      + name             = "gaspi-admin-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gaspi-dataportal*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.aws_iam_policy.manager_group_role_policy will be created
  + resource "aws_iam_policy" "manager_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "manager group permissions"
      + id               = (known after apply)
      + name             = "gaspi-manager-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gaspi-dataportal*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                  + {
                      + Action   = "pricing:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.aws_iam_role.admin_group_role will be created
  + resource "aws_iam_role" "admin_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi-admin-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.gaspi_authenticated will be created
  + resource "aws_iam_role" "gaspi_authenticated" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_authenticated"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.gaspi_unauthenticated will be created
  + resource "aws_iam_role" "gaspi_unauthenticated" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_unauthenticated"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.manager_group_role will be created
  + resource "aws_iam_role" "manager_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi-manager-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role_policy.gaspi_authenticated will be created
  + resource "aws_iam_role_policy" "gaspi_authenticated" {
      + id          = (known after apply)
      + name        = "authenticated_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gaspi-dataportal*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.cognito.aws_iam_role_policy.gaspi_unauthenticated will be created
  + resource "aws_iam_role_policy" "gaspi_unauthenticated" {
      + id          = (known after apply)
      + name        = "unauthenticated_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "*"
                      + Effect   = "Deny"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.cognito.aws_iam_role_policy_attachment.admin_group_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "admin_group_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "gaspi-admin-group-role"
    }

  # module.cognito.aws_iam_role_policy_attachment.manager_group_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "manager_group_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "gaspi-manager-group-role"
    }

  # module.cognito.aws_lambda_permission.SNSemailNotification will be created
  + resource "aws_lambda_permission" "SNSemailNotification" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "CognitoBackendAllowSNSemailNotificationInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.cognito.aws_lambda_permission.customMessageLambdaTrigger will be created
  + resource "aws_lambda_permission" "customMessageLambdaTrigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "cognito-idp.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowCustomMessageLambdaTriggerInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.cognito.aws_ses_configuration_set.ses_feedback_config will be created
  + resource "aws_ses_configuration_set" "ses_feedback_config" {
      + arn                        = (known after apply)
      + id                         = (known after apply)
      + last_fresh_start           = (known after apply)
      + name                       = "ses-feedback-config"
      + region                     = "ap-southeast-3"
      + reputation_metrics_enabled = false
      + sending_enabled            = true
    }

  # module.cognito.aws_ses_event_destination.ses_feedback_event_destination will be created
  + resource "aws_ses_event_destination" "ses_feedback_event_destination" {
      + arn                    = (known after apply)
      + configuration_set_name = "ses-feedback-config"
      + enabled                = true
      + id                     = (known after apply)
      + matching_types         = [
          + "bounce",
          + "complaint",
          + "delivery",
        ]
      + name                   = "ses-feedback-event-destination"
      + region                 = "ap-southeast-3"

      + sns_destination {
          + topic_arn = (known after apply)
        }
    }

  # module.cognito.aws_ses_identity_notification_topic.bounce will be created
  + resource "aws_ses_identity_notification_topic" "bounce" {
      + id                       = (known after apply)
      + identity                 = "diantest2020@gmail.com"
      + include_original_headers = true
      + notification_type        = "Bounce"
      + region                   = "ap-southeast-3"
      + topic_arn                = (known after apply)
    }

  # module.cognito.aws_ses_identity_notification_topic.complaint will be created
  + resource "aws_ses_identity_notification_topic" "complaint" {
      + id                       = (known after apply)
      + identity                 = "diantest2020@gmail.com"
      + include_original_headers = true
      + notification_type        = "Complaint"
      + region                   = "ap-southeast-3"
      + topic_arn                = (known after apply)
    }

  # module.cognito.aws_ses_identity_notification_topic.delivery will be created
  + resource "aws_ses_identity_notification_topic" "delivery" {
      + id                       = (known after apply)
      + identity                 = "diantest2020@gmail.com"
      + include_original_headers = true
      + notification_type        = "Delivery"
      + region                   = "ap-southeast-3"
      + topic_arn                = (known after apply)
    }

  # module.cognito.aws_sns_topic.sesDeliveryLogger will be created
  + resource "aws_sns_topic" "sesDeliveryLogger" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "sesDeliveryLogger"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.cognito.aws_sns_topic_policy.sesDeliveryLogger will be created
  + resource "aws_sns_topic_policy" "sesDeliveryLogger" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
      + region = "ap-southeast-3"
    }

  # module.cognito.aws_sns_topic_subscription.sesDeliveryLogger will be created
  + resource "aws_sns_topic_subscription" "sesDeliveryLogger" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.cognito.null_resource.cognito_migration will be created
  + resource "null_resource" "cognito_migration" {
      + id       = (known after apply)
      + triggers = {
          + "admin_username" = "admin@example.com"
          + "guest_username" = "guest@example.com"
          + "user_pool_name" = "gaspi-users"
        }
    }

  # module.error-catcher.data.aws_iam_policy_document.lambda-notifyOnError will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-notifyOnError" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cloudwatch:DescribeAlarms",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "events:describeRule",
              + "events:disableRule",
              + "events:enableRule",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricData",
              + "cloudwatch:ListMetrics",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:FilterLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:ap-southeast-3:997141225542:log-group:/aws/lambda/*",
            ]
        }
      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:997141225542:configuration-set/*",
              + "arn:aws:ses:ap-southeast-3:997141225542:identity/*",
            ]
        }
    }

  # module.error-catcher.aws_cloudwatch_event_rule.notifyOnError-trigger will be created
  + resource "aws_cloudwatch_event_rule" "notifyOnError-trigger" {
      + arn                 = (known after apply)
      + description         = "A trigger that runs the notifyOnError lambda function while the alarm is in ALARM state."
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "error-catcher-notifyOnError-trigger"
      + name_prefix         = (known after apply)
      + region              = "ap-southeast-3"
      + schedule_expression = "cron(*/20 * * * ? *)"
      + tags_all            = {
          + "Environment" = "dev"
          + "NAME"        = "error-catcher"
          + "Owner"       = "gaspi"
        }
    }

  # module.error-catcher.aws_cloudwatch_event_target.notifyOnError-trigger will be created
  + resource "aws_cloudwatch_event_target" "notifyOnError-trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ap-southeast-3"
      + rule           = "error-catcher-notifyOnError-trigger"
      + target_id      = "error-catcher-lambda-notifyOnError"
    }

  # module.error-catcher.aws_cloudwatch_metric_alarm.notifyOnError-alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "notifyOnError-alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm if any Lambda function in the region has errors"
      + alarm_name                            = "error-catcher-notifyOnError"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 2400
      + region                                = "ap-southeast-3"
      + statistic                             = "Sum"
      + tags_all                              = {
          + "Environment" = "dev"
          + "NAME"        = "error-catcher"
          + "Owner"       = "gaspi"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.error-catcher.aws_lambda_permission.SNS-notifyOnError will be created
  + resource "aws_lambda_permission" "SNS-notifyOnError" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "ErrorCatcherAllowSNSnotifyOnErrorInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.error-catcher.aws_lambda_permission.cloudwatch-notifyOnError will be created
  + resource "aws_lambda_permission" "cloudwatch-notifyOnError" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "error-catcher-notifyOnError"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "ErrorCatcherCloudwatchNotifyOnErrorInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.error-catcher.aws_s3_bucket.recent-errors will be created
  + resource "aws_s3_bucket" "recent-errors" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "error-catcher-recent-errors-"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "error-catcher"
          + "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.error-catcher.aws_s3_bucket_lifecycle_configuration.recent-errors-lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "recent-errors-lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "ap-southeast-3"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "remove-old-files"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 1
              + expired_object_delete_marker = false
            }

          + filter {
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.error-catcher.aws_sns_topic.notifyOnError will be created
  + resource "aws_sns_topic" "notifyOnError" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "error-catcher-notifyOnError"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "error-catcher"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.error-catcher.aws_sns_topic_subscription.notifyOnError will be created
  + resource "aws_sns_topic_subscription" "notifyOnError" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.gaspifs.null_resource.gaspifs-upload will be created
  + resource "null_resource" "gaspifs-upload" {
      + id       = (known after apply)
      + triggers = {
          + "cargo_lock_hash"  = "995e1eb171238ec751da3c1d3a32387dfe4ccb9f"
          + "cargo_toml_hash"  = "465eadc0bfe3b774a527baf84772f158bec989ed"
          + "docker_file_hash" = "a20d1ec7ca803881a0e501bb2d176e636409a8c3"
          + "source_hash"      = "cf4a361237609d6aaadccf79ead79e97d4bf5608"
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.ec2_references_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_references_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-batchStarter will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-batchStarter" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:GetAccountSettings",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricStatistics",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-batchSubmit will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-batchSubmit" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-getResultsURL will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getResultsURL" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:Query",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-initFlow will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-initFlow" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-qcFigures will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-qcFigures" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-qcNotes will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-qcNotes" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-sendJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].archive_file.binaries_layer will be created
  + resource "archive_file" "binaries_layer" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "pgxflow/binaries.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "pgxflow/layers/binaries/"
      + type                = "zip"
    }

  # module.pgxflow[0].aws_api_gateway_authorizer.pgxflow_user_pool_authorizer will be created
  + resource "aws_api_gateway_authorizer" "pgxflow_user_pool_authorizer" {
      + arn                              = (known after apply)
      + authorizer_result_ttl_in_seconds = 300
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "pgxflow-userpool-authorizer"
      + provider_arns                    = (known after apply)
      + region                           = "ap-southeast-3"
      + rest_api_id                      = (known after apply)
      + type                             = "COGNITO_USER_POOLS"
    }

  # module.pgxflow[0].aws_api_gateway_deployment.PgxApi will be created
  + resource "aws_api_gateway_deployment" "PgxApi" {
      + created_date = (known after apply)
      + id           = (known after apply)
      + region       = "ap-southeast-3"
      + rest_api_id  = (known after apply)
      + triggers     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.batch-submit-options will be created
  + resource "aws_api_gateway_integration" "batch-submit-options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.pgxflow[0].aws_api_gateway_integration.batch-submit-post will be created
  + resource "aws_api_gateway_integration" "batch-submit-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.qcnotes-get will be created
  + resource "aws_api_gateway_integration" "qcnotes-get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.qcnotes-options will be created
  + resource "aws_api_gateway_integration" "qcnotes-options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.pgxflow[0].aws_api_gateway_integration.qcnotes-post will be created
  + resource "aws_api_gateway_integration" "qcnotes-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.results-get will be created
  + resource "aws_api_gateway_integration" "results-get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.results-options will be created
  + resource "aws_api_gateway_integration" "results-options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.pgxflow[0].aws_api_gateway_integration.submit-options will be created
  + resource "aws_api_gateway_integration" "submit-options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id            = (known
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.